# Advanced Querying Mongo

Importing libraries and setting up connection

In [45]:
from pymongo import MongoClient
import pandas as pd

In [14]:
str_conn='mongodb://localhost:27017'

cursor=MongoClient(str_conn)

In [15]:
#me aseguro que companies está en mongo
cursor.list_database_names()

['admin', 'companies', 'config', 'local']

In [19]:
#selecciono una base de datos
com = cursor.companies
#selecciono la coleccion
colec = com.companies

### 1. All the companies whose name match 'Babelgum'. Retrieve only their `name` field.

In [23]:
# Your Code
query = {'name':'Babelgum'}
select = {'_id': 0, 'name': 1} # 0 es que no venga, 1 es que venga, es para columnas
list(colec.find(query,select))

[{'name': 'Babelgum'}]

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [46]:
# Your Code
query = {'number_of_employees': {'$gte': 5000}}
select = {'name': 1, 'number_of_employees': 1, '_id': 0}

results = colec.find(query, select).sort('number_of_employees', -1).limit(20)
df = pd.DataFrame(results)
df
#el -1 es ordenadar de forma desc y lo convierto a dataframe para verlo mejor

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fields.

In [85]:
# Your Code

query={'$and': [{'founded_year': {'$lt': 2005}},
                {'founded_year': {'$gt': 2000}}]}
select = {'name': 1, 'founded_year': 1, '_id': 0}

results = colec.find(query, select)
df = pd.DataFrame(results)

In [104]:
df.head()

          name  founded_year
0         Digg          2004
1     Facebook          2004
2  StumbleUpon          2002
3       Gizmoz          2003
4        Plaxo          2002

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [87]:
# Your Code

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [106]:
# Your Code
query={'$and': [{'number_of_employees': {'$lt': 1000}},
                {'founded_year': {'$lt': 2005}}]}
select = {'name': 1, 'number_of_employees': 1, '_id': 0}

results = colec.find(query, select).sort('number_of_employees', -1).limit(10)
df = pd.DataFrame(results)
df

                              name  number_of_employees
0             Infinera Corporation                  974
1  NorthPoint Communications Group                  948
2                     888 Holdings                  931
3               Forrester Research                  903
4                        SonicWALL                  900
5                       Webmetrics                  900
6             Cornerstone OnDemand                  881
7                          Mozilla                  800
8                       Buongiorno                  800
9                             Yelp                  800

### 6. All the companies that don't include the `partners` field.

In [124]:
# Your Code
query = {'partners': []}
select = {'name': 1,'_id': 0}

results = colec.find(query,select)

#pongo el select porque el resto de columnas no me interesan quiero solo el nombre


df = pd.DataFrame(results)
df.head()

        name
0   Wetpaint
1  AdventNet
2       Zoho
3       Digg
4   Facebook

### 7. All the companies that have a null type of value on the `category_code` field.

In [126]:
# Your Code
query = {'category_code': None}
select = {'name': 1,'_id': 0}

results = colec.find(query, select)

df = pd.DataFrame(results)
df.head()

           name
0    Collective
1       Snimmer
2        KoolIM
3  Level9 Media
4       VidKing

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [128]:
# Your Code
query={'$and': [{'number_of_employees': {'$gte': 100}},
                {'number_of_employees': {'$lt': 1000}}]}
select = {'name': 1, 'number_of_employees': 1, '_id': 0}

results = colec.find(query, select)
df = pd.DataFrame(results)
df.head()

        name  number_of_employees
0  AdventNet                  600
1    AddThis                  120
2      OpenX                  305
3   LifeLock                  644
4      Jajah                  110

### 9. Order all the companies by their IPO price in a descending order.

In [112]:
# Your Code

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [140]:
# Your Code

#lo he intenado directamente con un select pero hace falta un query así que 
#pongo en aquellos que exista un valor


query = {'number_of_employees': {'$exists': True}}
select = {'name': 1, 'number_of_employees': 1, '_id': 0}


results = colec.find(query,select).sort('number_of_employees', -1).limit(10)
df = pd.DataFrame(results)
df.head()

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [151]:
# Your Code
#si el segundo semestre es desde el 1 de julio hasta el 31 de diciembre

query = {'founded_month': {'$gte': 7}}
select = {'name': 1, '_id': 0}

results = colec.find(query, select).limit(1000)
df = pd.DataFrame(results)
df.head()

        name
0   Wetpaint
1       Zoho
2       Digg
3  Omnidrive
4       eBay

### 12. All the companies founded before 2000 that have an acquisition amount of more than 10.000.00

In [142]:
# Your Code
query={'$and': [{'total_money_raised': {'$gte': 100}},
                {'founded_year': {'$lt': 2000}}]}
select = {'name': 1, 'number_of_employees': 1, '_id': 0}

results = colec.find(query, select)
df = pd.DataFrame(results)
df.head()

### 13. All the companies that have been acquired after 2010, order by the acquisition amount, and retrieve only their `name` and `acquisition` field.

In [143]:
# Your Code

### 14. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

In [144]:
# Your Code

### 15. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `acquisition price` in a descending order. Limit the search to 10 documents.

In [145]:
# Your Code

### 16. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascending order.

In [146]:
# Your Code

### 17. All the companies whose acquisition amount is more than 10.000.000, and currency is 'EUR'.

In [147]:
# Your Code

### 18. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

In [148]:
# Your Code

# Bonus
### 19. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [149]:
# Your Code

### 20. All the companies that have been 'deadpooled' after the third year.

In [150]:
# Your Code